Revit 2024 API
BuiltInFailures.SketchFailures.FloorCannotAddDirectionCurveError Property
 Cannot add the direction curve in the floor sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FloorCannotAddDirectionCurveError { get; }
Visual Basic
Public Shared ReadOnly Property FloorCannotAddDirectionCurveError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FloorCannotAddDirectionCurveError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace